app/controllers/groups_controller.rb

  def index
    @groups = Group.all.order('nombre ASC')
---
SELECT "groups".* FROM "groups" ORDER BY nombre ASC